class UnicodeFontConverter:
    def __init__(self):
        sutonnymj = {
            'Q': 'ঙ', 'W': 'য', 'E': 'ড', 'R': 'অ', 'T': 'ও',
            'Y': 'ই', 'U': 'উ', 'I': 'ঘ', 'O': 'খ', 'P': 'ছ',
            'A': 'া', 'S': 'শ', 'D': 'ব', 'F': 'গ', 'G': 'প',
            'H': 'ফ', 'J': 'ক', 'K': 'ত', 'L': 'চ', ':': 'জ',
            'Z': 'ং', 'X': 'ঁ', 'C': 'ঠ', 'V': 'দ', 'B': 'ণ',
            'N': 'ষ', 'M': 'স', '<': 'হ', '>': '।', '?': '্',
            'q': 'য়', 'w': 'ি', 'e': 'ে', 'r': 'ৗ', 't': 'ু',
            'y': 'ূ', 'u': 'ৃ', 'i': '্র', 'o': '্র', 'p': 'ঋ',
            'a': 'ৗ', 's': 'া', 'd': 'ৃ', 'f': 'ূ', 'g': 'উ',
            'h': 'ে', 'j': 'ৈ', 'k': 'ো', 'l': 'অ', ';': 'ং',
            '1': '১', '2': '২', '3': '৩', '4': '৪', '5': '৫',
            '6': '৬', '7': '৭', '8': '৮', '9': '৯', '0': '০',
            '!': '!', '@': 'ঙ', '#': '৳', '$': 'ষ', '%': 'ে',
            '^': 'ূ', '&': 'ু', '*': '*', '(': '(', ')': ')'
        }

        self.mapping = {
            'sutonnymj': sutonnymj
        }
    
    def convert(self, text, font):
        font = font.lower()
        assert font in self.mapping, f"Font {font} not supported"

        return ''.join([self.mapping[font].get(c, c) for c in text])